Revit 2027 API
ScheduleDefinition.GetSchedulableFields Method
 Gets a list of all non-calculated/non-combined fields that are eligible to be included in this schedule.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<SchedulableField> GetSchedulableFields()
Public Function GetSchedulableFields As IList(Of SchedulableField)
public:
IList<SchedulableField^>^ GetSchedulableFields()
member GetSchedulableFields : unit -> IList<SchedulableField>
Return Value
IList<SchedulableField>
 A list of SchedulableField objects representing the non-calculated/non-combined fields that may be included in the schedule.
See Also
Reference
ScheduleDefinition Class
Autodesk.Revit.DB Namespace